//Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
let array1 = []; 

for (let i = 20; i <= 30; i += 0.5) {
    array1.push(i);
};

console.log(array1.join(' '));

//Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

let array2 = [];

let dollar = 27;

for (i = 10; i <= 100; i += 10) {
    array2.push(dollar * i);
};

console.log(array2);

//Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

let numNature = prompt('Введіть ціле число');

let array3 = [];

for (i = 1; i <= 100; i++) {
    if (i ** 2 < numNature) {
        console.log(array3.push(i));
    }
};

//Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

let n = +prompt('Введіть ціле число №2');

function isPrime(n) {
    for (let i = 2; i < n; i++) {
        if (n % i == 0) {
            return false
        }
    } 
    return n > 1;
}

alert(isPrime(n) ? "Число просте " : "Число непросте");


//Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

let num = prompt('Введіть ціле число №3');

while (num % 3 == 0) {
    num /= 3;
}
alert((num == 1) ? "Число можна отримати " : "Число не можна отримати");